{
    "common": {
        "loading": "Cargando...",
        "loadingContent": "Cargando contenido...",
        "noResults": "No se encontraron resultados",
        "cancel": "Cancelar",
        "delete": "Eliminar",
        "save": "Guardar",
        "close": "Cerrar",
        "searchPlaceholder": "Buscar...",
        "search": "Buscar",
        "filter": "Filtrar",
        "clearFilters": "Limpiar filtros activos",
        "applyFilters": "Aplicar Filtros",
        "sortBy": "Ordenar Por",
        "releaseYear": "Año de Lanzamiento",
        "genre": "Género",
        "exampleYear": "Ej. 2023",
        "signIn": "Iniciar Sesión",
        "signUp": "Regístrate",
        "or": "o",
        "new": "NUEVO",
        "watched": "VISTO"
    },
    "tabs": {
        "home": "Inicio",
        "foryou": "Para ti",
        "movies": "Películas",
        "tv": "Series",
        "favorites": "Favoritos",
        "watchlist": "Watchlist",
        "recommendations": "Sugeridas",
        "profile": "Perfil"
    },
    "home": {
        "continueWatching": "Continuar Viendo",
        "bannerTitle": "¡Dale estilo a tu cuenta!",
        "bannerSubtitle": "Cambia tu nombre de usuario genérico en tu perfil."
    },
    "favorites": {
        "emptyTitle": "No tienes favoritos aún",
        "emptySubtitle": "Explora películas y series para añadir a tus favoritos"
    },
    "watchlist": {
        "emptyTitle": "Tu lista está vacía",
        "emptySubtitle": "Añade películas y series que quieras ver más tarde"
    },
    "recommendations": {
        "received": "Recibidas",
        "sent": "Enviadas",
        "unauthTitle": "Inicia sesión para ver tus recomendaciones",
        "emptyReceivedTitle": "No tienes recomendaciones",
        "emptyReceivedSubtitle": "Cuando alguien te recomiende algo, aparecerá aquí",
        "emptySentTitle": "No has enviado recomendaciones",
        "emptySentSubtitle": "Explora películas y series para recomendar a tus amigos",
        "deleteTitle": "Eliminar Recomendación",
        "deleteText": "¿Estás seguro de que quieres eliminar esta recomendación? Esta acción no se puede deshacer.",
        "from": "De: {{user}}",
        "to": "Para: {{user}}",
        "comments": "Comentarios",
        "writeComment": "Escribe un comentario...",
        "noComments": "No hay comentarios aún.",
        "you": "Tú"
    },
    "contentGrid": {
        "unauthTitle": "Inicia sesión para ver tu lista"
    },
    "auth": {
        "loginTitle": "Iniciar Sesión",
        "loginSubtitle": "Tu guía de cine y series",
        "noAccount": "¿No tienes cuenta?",
        "identifier": "Email o Usuario",
        "identifierPlaceholder": "tu@email.com o usuario",
        "password": "Contraseña",
        "passwordPlaceholder": "••••••••",
        "registerTitle": "CortoCrudo",
        "registerSubtitle": "Crea tu cuenta",
        "registerButton": "Crear Cuenta",
        "alreadyAccount": "¿Ya tienes cuenta?",
        "username": "Nombre de Usuario",
        "usernamePlaceholder": "usuario_123",
        "email": "Email",
        "emailPlaceholder": "tu@email.com",
        "passwordMin": "Mínimo 8 caracteres",
        "confirmPassword": "Confirmar Contraseña",
        "confirmPasswordPlaceholder": "Repite tu contraseña"
    },
    "profile": {
        "title": "Perfil",
        "avatar": {
            "takePhoto": "Tomar foto",
            "chooseGallery": "Elegir de galería",
            "deletePhoto": "Eliminar foto",
            "cancel": "Cancelar",
            "title": "Foto de perfil",
            "subtitle": "Elige una opción"
        },
        "genericUsername": "Aún tienes un nombre genérico. ¡Personaliza tu perfil!",
        "sections": {
            "info": "Información del perfil",
            "settings": "Configuración",
            "about": "Acerca de",
            "account": "Cuenta"
        },
        "fields": {
            "username": "Nombre de usuario",
            "email": "Correo electrónico",
            "memberSince": "Miembro desde"
        },
        "settings": {
            "notifications": "Notificaciones",
            "theme": "Tema",
            "language": "Idioma"
        },
        "about": {
            "helpCenter": "Centro de ayuda",
            "privacyPolicy": "Política de privacidad",
            "termsService": "Términos de servicio",
            "version": "Versión",
            "author": "Made with ❤️ by Pabl0Parra"
        },
        "actions": {
            "deleteAccount": "Eliminar cuenta",
            "signOut": "Cerrar Sesión",
            "save": "Guardar",
            "cancel": "Cancelar"
        },
        "alerts": {
            "successUsername": "Nombre de usuario actualizado",
            "success": "Éxito",
            "comingSoonTitle": "Próximamente",
            "comingSoonText": "estará disponible pronto.",
            "signOutTitle": "Cerrar sesión",
            "signOutText": "¿Estás seguro de que quieres cerrar sesión?",
            "deleteAccountTitle": "Eliminar cuenta",
            "deleteAccountText": "Esta acción es irreversible. Se eliminarán todos tus datos, listas y recomendaciones. ¿Estás seguro de que quieres continuar?",
            "deleteAccountConfirm": "Eliminar cuenta definitivamente",
            "accountDeletedTitle": "Cuenta eliminada",
            "accountDeletedText": "Tu cuenta y todos tus datos han sido eliminados correctamente.",
            "errorTitle": "Error",
            "errorDeleteAccount": "No se pudo eliminar la cuenta. Por favor, intenta de nuevo o contacta a soporte."
        },
        "languageModal": {
            "title": "Seleccionar Idioma",
            "close": "Cerrar"
        }
    },
    "help": {
        "title": "Centro de Ayuda",
        "searchPlaceholder": "Busca tu duda (ej. recomendar, perfil)...",
        "noResults": "No encontramos respuestas para esa búsqueda.",
        "needHelp": "¿Aún necesitas ayuda?",
        "supportSubtitle": "Envíanos un correo y te responderemos lo antes posible.",
        "contactSupport": "Contactar a Soporte",
        "q1": "¿Qué es CortoCrudo?",
        "a1": "CortoCrudo es tu aplicación personal para mantener un registro de las películas y series que has visto, descubrir nuevos títulos y compartir recomendaciones directamente con tus amigos.",
        "q2": "¿Cómo agrego una película a mis listas?",
        "a2": "Busca cualquier película o serie en la pestaña de Inicio. Al seleccionarla, verás opciones para agregarla a \"Favoritos\" o a tu \"Lista de seguimiento\" (Watchlist) tocando los botones debajo del póster.",
        "q3": "¿Cómo recomiendo una película a mis amigos?",
        "a3": "En la pantalla de detalles de cualquier título, presiona el botón \"Recomendar\". Se abrirá una pantalla donde podrás buscar a tus amigos por su nombre de usuario, escribir un mensaje y enviarles la recomendación. Ellos la recibirán en su pestaña \"Para ti\".",
        "q4": "¿Puedo ver las películas directamente en la app?",
        "a4": "No, CortoCrudo funciona como un diario y recomendador personal. Utilizamos la API de TMDb para brindarte toda la información y metadatos de los títulos, pero no proveemos servicios de streaming.",
        "q5": "¿Por qué no veo películas en español?",
        "a5": "Si una película o serie no tiene una traducción oficial al español en la base de datos global de TMDb, se mostrará su título y sinopsis original.",
        "q6": "¿Cómo cambio mi nombre de usuario genérico?",
        "a6": "Ve a la pestaña de \"Perfil\". En la sección \"Información del perfil\", presiona el botón de edición junto a tu nombre de usuario para personalizarlo.",
        "q7": "¿Cómo elimino mi cuenta?",
        "a7": "Puedes eliminar tu cuenta y todos sus datos permanentemente desde la pestaña de \"Perfil\", desplazándote hacia abajo hasta la sección \"Cuenta\" y seleccionando \"Eliminar cuenta\"."
    },
    "privacy": {
        "title": "Política de Privacidad",
        "lastUpdated": "Última actualización: Febrero 2026",
        "p1": "En CortoCrudo, valoramos y respetamos su privacidad. Esta Política de Privacidad describe cómo recopilamos, utilizamos y protegemos su información personal cuando utiliza nuestra aplicación móvil.",
        "s1Title": "1. Información que recopilamos",
        "s1Text": "Recopilamos la información que usted nos proporciona directamente al crear una cuenta, como su dirección de correo electrónico, nombre de usuario (opcional) y contraseña. También recopilamos datos sobre su uso de la aplicación, como las películas y series que agrega a sus listas de favoritos, su progreso de visualización y sus recomendaciones.",
        "s2Title": "2. Uso de la información",
        "s2Text": "Utilizamos su información personal únicamente para proporcionar y mejorar los servicios de CortoCrudo. Esto incluye autenticar su cuenta, sincronizar sus listas entre dispositivos y habilitar funciones sociales como las recomendaciones entre usuarios.",
        "s3Title": "3. Almacenamiento y Protección",
        "s3Text": "Toda la información personal (incluyendo credenciales de cuenta, listas y progreso) se almacena de manera segura utilizando Supabase, una plataforma de base de datos segura de terceros. Sus contraseñas son encriptadas por Supabase y no son accesibles para nosotros.",
        "s4Title": "4. Servicios de Terceros",
        "s4Text": "CortoCrudo utiliza la interfaz de programación de aplicaciones (API) de TMDb (The Movie Database) para obtener información sobre películas, series e imágenes relacionadas. No compartimos su información personal con TMDb. Su uso de la información provista por TMDb está sujeto a sus propios términos y políticas.",
        "s5Title": "5. Derechos del Usuario",
        "s5Text": "Usted tiene el control total sobre sus datos. Puede eliminar su cuenta y toda la información asociada a ella (incluyendo listas de reproducción y recomendaciones) en cualquier momento desde la sección \"Cuenta\" en la pestaña de Perfil.",
        "s6Title": "6. Cambios a esta política",
        "s6Text": "Podemos actualizar esta Política de Privacidad ocasionalmente para reflejar cambios en nuestras prácticas. Le notificaremos cualquier actualización importante dentro de la aplicación."
    },
    "terms": {
        "title": "Términos de Servicio",
        "lastUpdated": "Última actualización: Febrero 2026",
        "p1": "Bienvenido a CortoCrudo. Al descargar, acceder o utilizar esta aplicación, usted acepta estar sujeto a los siguientes Términos de Servicio.",
        "s1Title": "1. Propósito de la Aplicación",
        "s1Text": "CortoCrudo es una aplicación diseñada para organizar, rastrear y descubrir contenido de entretenimiento (películas y series de televisión). La aplicación NO proporciona streaming, transmisión o descarga de contenido multimedia protegido por derechos de autor.",
        "s2Title": "2. Cuentas de Usuario",
        "s2Text": "Para utilizar todas las funciones de CortoCrudo, debe crear una cuenta. Usted es responsable de mantener la confidencialidad de sus credenciales de inicio de sesión y de todas las actividades que ocurran bajo su cuenta. CortoCrudo no se hace responsable por ninguna pérdida o daño derivado de su incumplimiento de esta obligación de seguridad.",
        "s3Title": "3. Uso Aceptable",
        "s3Text": "Usted acepta utilizar CortoCrudo solo para fines lícitos y de una manera que no infrinja los derechos de, restrinja o inhiba el uso de la aplicación por parte de terceros. No debe utilizar la aplicación para transmitir contenido malicioso, acosar a otros usuarios o intentar acceder a información de otros usuarios.",
        "s4Title": "4. Descargo de Responsabilidad de TMDb",
        "s4Text": "Este producto utiliza la API de TMDb (The Movie Database) para proporcionar metadatos e imágenes pero NO está respaldado, certificado ni afiliado a TMDb. Toda la información relacionada con películas y series es propiedad de TMDb y de sus respectivos autores/creadores.",
        "s5Title": "5. Modificación de los Términos",
        "s5Text": "Nos reservamos el derecho de modificar o reemplazar estos Términos en cualquier momento. Si publicamos una actualización, el uso continuado de la aplicación constituirá su aceptación de los nuevos términos."
    }
}